<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Evernote and imports into FileWave.

Alternate Beta URL that can be used for SPARKLE_FEED_URL:
http://update.evernote.com/prerelease/ENMac/EvernoteMacUpdate.xml
</string>
    <key>Identifier</key>
    <string>com.github.johncclayton.filewave.Evernote</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Evernote</string>
        <key>FW_FILESET_GROUP</key>
        <string>Evernote for Desktop</string>
        <key>SPARKLE_FEED_URL</key>
        <string>http://update.evernote.com/public/ENMac/EvernoteMacUpdate.xml</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
	<string>com.github.autopkg.download.Evernote</string>
    <key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.johncclayton.filewave.Evernote/FileWaveImporter</string>
            <key>Arguments</key>
            <dict>
                <key>fw_import_source</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app</string>
                <key>fw_fileset_name</key>
                <string>%NAME%</string>
                <key>fw_fileset_group</key>
                <string>Mac Desktop</string>
                <key>fw_destination_root</key>
                <string>/Applications/%NAME%.app</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
