<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Adobe Reader and imports into FileWave.
Set MAJOR_VERSION to "10" to get the latest/last version of Adobe Reader 10 instead of 11.

Additional notes:
- The Reader website states that 10.6.4 is a minimum requirement for 11.
- The preinstall_script is there to get around an oversight in the package's
preflight script, looking to find a user's trash folder to copy the .app into.
</string>
	<key>Identifier</key>
	<string>com.github.autopkg.filewave.AdobeReader</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Adobe Reader</string>
        <key>fw_fileset_group</key>
        <string>%fw_fileset_group%</string>
        <key>fw_destination_root</key>
        <string>/Applications/Adobe Reader.app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.AdobeReader</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkg_unpack</string>
				<key>flat_pkg_path</key>
				<string>%pathname%/*.pkg</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/application_payload/Applications</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/application_payload/Applications</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/pkg_unpack/application.pkg/Payload</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%RECIPE_CACHE_DIR%/application_payload/Applications/Adobe Reader.app</string>
				<key>plist_keys</key>
				<dict>
					<key>CFBundleIdentifier</key>
					<string>fw_app_bundle_id</string>
					<key>CFBundleShortVersionString</key>
					<string>fw_app_version</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PlistReader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_destination_root</key>
				<string>%fw_destination_root%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %fw_app_version%</string>
				<key>fw_import_source</key>
				<string>%RECIPE_CACHE_DIR%/application_payload/Applications/Adobe Reader.app</string>
                <key>fw_fileset_group</key>
                <string>%fw_fileset_group%</string>
			</dict>
			<key>Comment</key>
			<string>Import the Adobe Reader app into FileWave</string>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
