<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Adium and imports into FileWave.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.filewave.Adium</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Adium</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.Adium</string>
    <key>Process</key>
    <array>
         <dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/%NAME%.app</string>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/%NAME%.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
            <key>Arguments</key>
            <dict>
                <key>fw_app_bundle_id</key>
                <string>com.github.autopkg.filewave.Adium</string>

                <key>fw_app_version</key>
                <string>%version%</string>

                <key>fw_import_source</key>
                <string>%pkgroot%/Applications/%NAME%.app</string>

                <key>fw_fileset_name</key>
                <string>%NAME% - %version%</string>

                <key>fw_destination_root</key>
                <string>/Applications/%NAME%.app</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
