<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Adobe Flash Player installer, imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.filewave.FlashPlayerNoRepackage</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AdobeFlashPlayer</string>
        <key>fw_app_bundle_id</key>
        <string>com.github.autopkg.filewave.FlashPlayerNoRepackage</string>
        <key>fw_app_version</key>
        <string>%version%</string>
        <key>fw_fileset_group</key>
        <string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.FlashPlayerExtractPackage</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%fw_app_version%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%pkg_path%</string>
                <key>fw_fileset_group</key>
                <string>%fw_fileset_group%</string>
			</dict>
			<key>Comment</key>
			<string>Import the Flash Player pkg into FileWave</string>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
